Tsungs/test2.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
<clients>
<client host="localhost" use_controller_vm="true" maxusers="50000"/>
</clients>
<servers>
<server host="ec2-52-25-227-50.us-west-2.compute.amazonaws.com" port="80" type="tcp"/>
</servers>
<load>
<arrivalphase phase="1" duration="30" unit="second">
<users arrivalrate="1" unit="second"/>
</arrivalphase>
<arrivalphase phase="2" duration="30" unit="second">
<users arrivalrate="2" unit="second"/>
</arrivalphase>
<arrivalphase phase="3" duration="30" unit="second">
<users arrivalrate="4" unit="second"/>
</arrivalphase>
</load>
<options>
<option name="glocal_ack_timeout" value="2000"/>
<option type="ts_http" name="user_agent">
<user_agent probability="100">
Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4
</user_agent>
</option>
</options>
<sessions>
<session name="http-example" probability="100" type="ts_http">
<request>
<http url="/" version="1.1" method="GET"/>
</request>
<thinktime value="2" random="true"/>
<request>
<http url="/users/sign_up" version="1.1" method="GET"/>
</request>
<setdynvars sourcetype="random_number" start="1000" end="9999999">
<var name="random_user__name"/>
</setdynvars>
<request subst="true">
<dyn_variable name="created_user_url" re="[Ll]ocation: (http://.*)\r"/>
<dyn_variable name="created_user_id" re="[Ll]ocation: http://.*/users/(.*)\r"/>
<http url="/users" version="1.1" method="POST" contents="Email=%%_created_user_id%%@yahoo.com&amp;Password=12345678&amp;Password confirmation=12345678&amp;commit=Sign+Up"/>
</request>
</session>
</sessions>
</tsung>